<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;"></center>

# <center> Проект: Анализ вакансий из HeadHunter

In [2]:
import sqlalchemy
from sqlalchemy import text
import pandas as pd
import psycopg2

In [3]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [115]:
#затер пароли

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# ЗАПРОС
query_3_1 = '''
    SELECT *
    FROM vacancies
    '''

In [6]:
result = conn.execute(text(query_3_1)).fetchall()
df = pd.DataFrame(result)
display(df)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = '''
select
*
from employers
'''

In [8]:
result = conn.execute(text(query_3_2)).fetchall()
df = pd.DataFrame(result)
display(df)

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
query_3_3 = '''
select
*
from employers
'''

In [10]:
result = conn.execute(text(query_3_3)).fetchall()
df = pd.DataFrame(result)
display(df)

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4 = f'''
select
*
from public.industries
'''

In [12]:
result = conn.execute(text(query_3_4)).fetchall()
df = pd.DataFrame(result)
display(df)

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

***

In [13]:
# соездинения с БД установлено

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [14]:
query_4_1 = '''
select
a.name,
COUNT(v.id)
from public.VACANCIES v
join public.EMPLOYERS e ON v.employer_id = e.id
join public.AREAS a ON v.area_id = a.id
GROUP BY a.name
ORDER BY 2 desc
'''

In [15]:
result = conn.execute(text(query_4_1)).fetchall()
df = pd.DataFrame(result)
df.sample(3)
display(df)

                name  count
0             Москва   5333
1    Санкт-Петербург   2851
2              Минск   2112
3        Новосибирск   2006
4             Алматы   1892
..               ...    ...
764       Тарко-Сале      1
765    Новоаннинский      1
766            Бирск      1
767           Сасово      1
768             Анна      1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [16]:
query_4_2 = '''
SELECT
*
FROM
    public.vacancies v
WHERE salary_from IS NOT NULL

union

SELECT
*
FROM
    public.vacancies v
WHERE salary_to IS NOT NULL
'''

In [17]:
result = conn.execute(text(query_4_2)).fetchall()
df = pd.DataFrame(result)
df.sample(3)
display(df)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,6555939,Ведущий программист 1С,1С программирование\t1С: Бухгалтерия\t1С: Пред...,Удаленная работа,От 1 года до 3 лет,Полная занятость,150000.0,NaN,92,200522
1,14694668,Junior разработчик (стажер),None,Полный день,Нет опыта,Полная занятость,20000.0,NaN,92,1196086
2,14820007,Программист 1С,1С программирование\t1С: Бухгалтерия\t1С: Пред...,Удаленная работа,От 1 года до 3 лет,Полная занятость,100000.0,NaN,92,200522
3,16142474,Специалист по сопровождению ПО (техническая по...,SQL\tБазы данных,Полный день,Нет опыта,Полная занятость,20000.0,70000.0,96,1020927
4,17987111,Начинающий специалист контактного центра,None,Удаленная работа,Нет опыта,Полная занятость,32500.0,NaN,98,3776
...,...,...,...,...,...,...,...,...,...,...
24068,66195906,Программист 1С (поддержка пользователей),1С: Управление Торговлей\tSQL\t1С программиров...,Удаленная работа,От 3 до 6 лет,Полная занятость,90000.0,120000.0,92,909573
24069,66196086,Golang-разработчик,Golang\tLinux\tRedis\tGit\tRabbitMQ\tPHP,Полный день,От 1 года до 3 лет,Полная занятость,100000.0,NaN,76,44573
24070,66196283,"Ментор на курс (React, Python)",Git\tPython\tPostgreSQL\tSQL\tDjango Framework...,Полный день,От 1 года до 3 лет,Частичная занятость,14564.0,21845.0,2760,4326421
24071,66196369,IOS разработчик,Atlassian Jira\tSwift\tGit\tООП\tUnit Testing,Удаленная работа,От 3 до 6 лет,Полная занятость,167170.0,222893.0,2758,5706473
24072,66196438,Маркетолог,Продвижение бренда\tМаркетинговые исследования...,Полный день,Более 6 лет,Полная занятость,31809.0,37110.0,2759,3796695

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [18]:
query_4_3 = '''
SELECT
round(AVG(salary_from)),
round(AVG(salary_to))
FROM
    public.vacancies v
'''

In [19]:
result = conn.execute(text(query_4_3)).fetchall()
df = pd.DataFrame(result)
display(df)

   round   round
0  71065  110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [20]:
query_4_4 = '''
SELECT DISTINCT
schedule,
employment,
COUNT(id)
FROM
    public.vacancies v
GROUP BY schedule, employment
ORDER BY 3 DESC
'''

In [21]:
result = conn.execute(text(query_4_4)).fetchall()
df = pd.DataFrame(result)
display(df)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [22]:
query_4_5 = '''
SELECT 
DISTINCT(experience),
COUNT(id)
FROM
    public.vacancies v
GROUP BY experience
ORDER BY 2 ASC
'''

In [23]:
result = conn.execute(text(query_4_5)).fetchall()
df = pd.DataFrame(result)
display(df)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [24]:
# Больше всего вакансий для новичков (1-3 года работы), а более опытные сотрудники требуются в меньшем количестве. Хоть и удаленная работа и занимает 2 место, но чаще всего работодатели предлагают работу в офисе (Полный день - видимо это означает).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [25]:
query_5_1 = '''
select
e.name,
COUNT(v.id)
FROM public.vacancies v
JOIN public.EMPLOYERS e ON v.employer_id = e.id
GROUP BY e.name
ORDER BY 2 DESC
LIMIT 5
'''

In [26]:
result = conn.execute(text(query_5_1)).fetchall()
df = pd.DataFrame(result)
display(df)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [58]:
query_5_2 = '''
select
a.name,
COUNT(v.id) as total_vacancies,
COUNT(e.id) as total_employers
FROM areas a
left join employers e ON a.id = e.area
left join VACANCIES v ON a.id = v.area_id
where v.id is null
GROUP BY a.name
ORDER BY 3 DESC
'''

In [59]:
result = conn.execute(text(query_5_2)).fetchall()
df = pd.DataFrame(result)
display(df)

                               name  total_vacancies  total_employers
0                            Россия                0              410
1                         Казахстан                0              207
2                Московская область                0               75
3                Краснодарский край                0               19
4                          Беларусь                0               18
..                              ...              ...              ...
588                        Кувандык                0                0
589                        Куйбышев                0                0
590  Куйбышево (Ростовская область)                0                0
591                        Култаево                0                0
592                        Кульсары                0                0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [63]:
query_5_3 = '''
select 
e.name,
COUNT(DISTINCT v.area_id)
FROM employers e
left join vacancies v ON e.id = v.employer_id
GROUP BY e.name
ORDER BY 2 desc
'''

In [64]:
result = conn.execute(text(query_5_3)).fetchall()
df = pd.DataFrame(result)
display(df)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
23170                  СДЕЛКА      0
23171            Alandr Group      0
23172                     СДК      0
23173      Lemon Land Lombard      0
23174                  Махина      0

[23175 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [65]:
query_5_4 = '''
select 
COUNT(e.id)
FROM employers e
left join EMPLOYERS_INDUSTRIES e_i ON e.id = e_i.employer_id
WHERE e_i.industry_id is null
'''

In [66]:
result = conn.execute(text(query_5_4)).fetchall()
df = pd.DataFrame(result)
display(df)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [70]:
query_5_5 = '''
select 
e.name,
COUNT(e.id)
FROM employers e
left join EMPLOYERS_INDUSTRIES e_i ON e.id = e_i.employer_id
GROUP BY e.name
HAVING COUNT(e.id) = 4
ORDER BY 1
'''

In [71]:
result = conn.execute(text(query_5_5)).fetchall()
df = pd.DataFrame(result)
display(df)

                 name  count
0        101 Интернет      4
1            21vek.by      4
2                2ГИС      4
3                  2К      4
4         4 пикселя +      4
...               ...    ...
1136            ЮРИОН      4
1137  ЮТИП Технологии      4
1138           ЯКласс      4
1139            ЯрНео      4
1140    Яшин&Партнёры      4

[1141 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [72]:
query_5_6 = '''
select
i.name,
COUNT(e_i.employer_id)
FROM EMPLOYERS_INDUSTRIES e_i
JOIN INDUSTRIES i ON e_i.industry_id = i.id
GROUP BY i.name
HAVING i.name = 'Разработка программного обеспечения'
'''

In [73]:
result = conn.execute(text(query_5_6)).fetchall()
df = pd.DataFrame(result)
display(df)

                                  name  count
0  Разработка программного обеспечения   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [80]:
big_city = (
    "Москва", "Санкт-Петербург", "Новосибирск", 
    "Екатеринбург", "Казань", "Нижний Новгород", 
    "Красноярск", "Челябинск", "Самара", "Уфа", 
    "Ростов-на-Дону", "Омск", "Краснодар", 
    "Воронеж", "Пермь", "Волгоград"
)
# код запроса представляет из себя строковую переменную

In [81]:
query_5_7 = f'''(SELECT 
                a.name,
                count(*) cnt
         from employers e
         join vacancies v on e.id = v.employer_id
         join areas a on a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {big_city}
            GROUP BY a.id
            ORDER BY 2 ASC)
            
            UNION ALL 

            (SELECT 
                'TOTAL',
                COUNT (*) "Общ кол-во вакансий в городах-миллионниках"
            FROM public.vacancies v
                JOIN public.employers e ON e.id = v.employer_id
                JOIN public.areas a ON a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {big_city})            
           
        '''

In [82]:
result = conn.execute(text(query_5_7)).fetchall()
df = pd.DataFrame(result)
display(df)

               name  cnt
0             TOTAL  485
1              Омск   21
2         Челябинск   22
3        Красноярск   23
4         Волгоград   24
5    Ростов-на-Дону   25
6            Казань   25
7             Пермь   25
8            Самара   26
9               Уфа   26
10        Краснодар   30
11          Воронеж   32
12      Новосибирск   35
13  Нижний Новгород   36
14     Екатеринбург   39
15  Санкт-Петербург   42
16           Москва   54

***

In [40]:
# В HH.ru больше всего вакансий от it-компаний (Яндекс). Причем Яндекс нанимает без привязки к офису (удаленная работа).

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [87]:
query_6_1 = '''
select
count (*) as data_vacansies
from public.vacancies v 
where v.name ILIKE '%data%' OR v.name ILIKE '%данн%' OR v.name ILIKE '%Data%' OR v.name ILIKE '%Данн%'
'''

In [88]:
result = conn.execute(text(query_6_1)).fetchall()
df = pd.DataFrame(result)
display(df)

   data_vacansies
0            1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [100]:
query_6_2 = '''
select
count (*) as data_vacansies
from public.vacancies v 
where (v.name ILIKE '%data scientist%' OR v.name ILIKE '%data science%' OR v.name ILIKE '%исследователь данных%' OR v.name ILIKE '%machine learning%' OR v.name ILIKE '%машинн%обучен%%' OR (v.name ILIKE '%ML%' and v.name not ILIKE '%html%' and v.name not ILIKE '%teamlead%'))
and (v.name ILIKE '%junior%' or v.employment = 'Стажировка' or v.experience = 'Нет опыта')
'''

In [101]:
result = conn.execute(text(query_6_2)).fetchall()
df = pd.DataFrame(result)
display(df)

   data_vacansies
0              51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [102]:
query_6_3 = '''
select
count (v.id)
from public.vacancies v 
where (v.name ILIKE '%data scientist%' OR v.name ILIKE '%data science%' OR v.name ILIKE '%исследователь данных%' OR v.name ILIKE '%machine learning%' OR v.name ILIKE '%машинн%обучен%%' OR (v.name ILIKE '%ML%' and v.name not ILIKE '%html%' and v.name not ILIKE '%teamlead%'))
and (v.key_skills ILIKE '%postgres%' or v.key_skills ILIKE '%SQL%')
'''

In [103]:
result = conn.execute(text(query_6_3)).fetchall()
df = pd.DataFrame(result)
display(df)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [104]:
query_6_4 = '''
select
count (v.id)
from public.vacancies v 
where (v.name ILIKE '%data scientist%' OR v.name ILIKE '%data science%' OR v.name ILIKE '%исследователь данных%' OR v.name ILIKE '%machine learning%' OR v.name ILIKE '%машинн%обучен%%' OR (v.name ILIKE '%ML%' and v.name not ILIKE '%html%' and v.name not ILIKE '%teamlead%'))
and (v.key_skills ILIKE '%python%')
'''

In [105]:
result = conn.execute(text(query_6_4)).fetchall()
df = pd.DataFrame(result)
display(df)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [111]:
query_6_5 = '''
SELECT ROUND(AVG(length(key_skills) + 1 - length(REPLACE(key_skills, CHR(9), '' )))::numeric, 2) 
FROM vacancies 
WHERE ((name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%') OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%')) OR (name ILIKE '%machine learning%') OR (name ILIKE '%машинн%обучен%') AND (key_skills IS NOT NULL)) 
'''

In [112]:
result = conn.execute(text(query_6_5)).fetchall()
df = pd.DataFrame(result)
display(df)

  round
0  6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [116]:
query_6_6 = '''
SELECT
experience,
ROUND(AVG(COALESCE((salary_from+salary_to)/2, salary_from, salary_to)),0)
FROM public.vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%')  
OR (name ILIKE '%исследователь данных%')    
OR ((name LIKE '%ML%') 
AND (name NOT ILIKE '%HTML%')) 
OR (name ILIKE '%machine learning%') 
OR (name ILIKE '%машинн%обучен%') 
AND (key_skills IS NOT NULL))
AND ((salary_from IS NOT NULL) OR (salary_to IS NOT NULL))
GROUP BY experience         
'''

In [117]:
result = conn.execute(text(query_6_6)).fetchall()
df = pd.DataFrame(result)
display(df)

           experience   round
0           Нет опыта   74643
1  От 1 года до 3 лет  145236
2       От 3 до 6 лет  243115

***

In [53]:
# Для подавляющего большинства дата-саентистов требуется знание Питона. Также во многих случаях требуется знание SQL, но это не панацея. Зарплаты для дата-саентистов однозначно хорошая (реклама не врет).

# Общий вывод по проекту

In [54]:
# У айтишников высокие зарплаты, it-компании больше всех нанимают и предлагают удаленку, при этом хорошо платят.
# к сожалению, нет времени на доп исследования